handouts/jackknife3.tex
% Created 2011-06-20 Mon 12:12
\documentclass[11pt,english]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\input{handoutformat}
\providecommand{\alert}[1]{\textbf{#1}}

\title{When the Jackknife Fails}
%\author{}
\date{STAT 5840: Summer 2011}

\begin{document}

\maketitle

\thispagestyle{empty}

\section*{Watch out for statistics that are not smooth}
\label{sec-1}

The \texttt{islands} data are very skewed, so we used the sample median to measure the center.  We would like to estimate the standard error of our statistic, so we might try estimating with either the jackknife or the bootstrap.  But the jackknife can give wrong answers when the statistic whose SE is desired is not smooth (case in point: the sample median).

Watch what happens when we try to estimate the SE with both methods.
\begin{verbatim}
#jackknife3.R
n <- length(islands)
x <- islands

#jackknife estimate of se
Mj <- rep(0, times = n)
for (i in seq.int(n)) {  
  y <- x[-i]
  Mj[i] <- median(y)
}

Mjbar <- mean(Mj)
SEj <- sqrt((n-1)/n * sum((Mj - Mjbar)^2))

#bootstrap estimate of se
Mb <- replicate(1000, expr = {
                y <- sample(x, size = n, replace = TRUE)
                median(y) })
SEb <- sd(Mb)
\end{verbatim}



After the copy-paste of the above we may look at our results with the following.
\begin{verbatim}
SEj
SEb
\end{verbatim}

\begin{verbatim}
 [1] 6.855655
 [1] 9.49066
\end{verbatim}


Clearly the answers are different, and it's the jackknife we should through away.

\end{document}